
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3
		|ИЗ
		|	РегистрСведений.КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
	КонецЦикла;
	
		
КонецПроцедуры
