
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3,
		|	КомуОтвезлиПодаркиСрезПоследних.ДокументыРазвозил,
		|	КомуОтвезлиПодаркиСрезПоследних.ДатаПроверкиПодарков,
		|	КомуОтвезлиПодаркиСрезПоследних.ВремяРазвозитьПодарки
		|ИЗ
		|	РегистрСведений.КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
		Объект.ДокументыРазвозил = ВыборкаДетальныеЗаписи.ДокументыРазвозил;
		Объект.ДатаПроверкиПодарков = ВыборкаДетальныеЗаписи.ДатаПроверкиПодарков;
		Объект.ВремяРазвозитьПодарки = ВыборкаДетальныеЗаписи.ВремяРазвозитьПодарки;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПолучательДокументовПриИзменении(Элемент)
	СсылкаНаСправочник = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные.ПолучательДокументов;
	РеквизитыСправочникаВСтруктуре = ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник);
	Обед = "Обед";
	Пробел = " ";
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Адрес = РеквизитыСправочникаВСтруктуре.Адрес + Пробел + Обед + Пробел + РеквизитыСправочникаВСтруктуре.ВремяОбеда;
	СтрокаТаблицы.ФИОполучателя = РеквизитыСправочникаВСтруктуре.ФИОполучателя;
	СтрокаТаблицы.ТелПолучателя = РеквизитыСправочникаВСтруктуре.ТелПолучателя;
	СтрокаТаблицы.УровеньКлиента = РеквизитыСправочникаВСтруктуре.УровеньКлиента;
	СтрокаТаблицы.ВремяОбеда = РеквизитыСправочникаВСтруктуре.ВремяОбеда;
	
КонецПроцедуры

&НаСервере
Функция ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник)
	РеквизитыВСтруктуре = Новый Структура();
			
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Клиенты.Адрес,
		|	Клиенты.ФИОполучателя,
		|	Клиенты.ТелПолучателя,
		|	Клиенты.УровеньКлиента,
		|	Клиенты.ВремяОбеда
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСправочник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока (ВыборкаДетальныеЗаписи.Следующий()) Цикл
	
		РеквизитыВСтруктуре.Вставить("Адрес",ВыборкаДетальныеЗаписи.Адрес);
		РеквизитыВСтруктуре.Вставить("ФИОполучателя",ВыборкаДетальныеЗаписи.ФИОполучателя);
		РеквизитыВСтруктуре.Вставить("ТелПолучателя",ВыборкаДетальныеЗаписи.ТелПолучателя);
		РеквизитыВСтруктуре.Вставить("УровеньКлиента",ВыборкаДетальныеЗаписи.УровеньКлиента);
		РеквизитыВСтруктуре.Вставить("ВремяОбеда",ВыборкаДетальныеЗаписи.ВремяОбеда);
		
		
	КонецЦикла;
	
	Возврат РеквизитыВСтруктуре;
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции






