
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3,
		|	КомуОтвезлиПодаркиСрезПоследних.ДокументыРазвозил,
		|	КомуОтвезлиПодаркиСрезПоследних.ДатаПроверкиПодарков,
		|	КомуОтвезлиПодаркиСрезПоследних.ВремяРазвозитьПодарки
		|ИЗ
		|	РегистрСведений.КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
		Объект.ДокументыРазвозил = ВыборкаДетальныеЗаписи.ДокументыРазвозил;
		Объект.ДатаПроверкиПодарков = ВыборкаДетальныеЗаписи.ДатаПроверкиПодарков;
		Объект.ВремяРазвозитьПодарки = ВыборкаДетальныеЗаписи.ВремяРазвозитьПодарки;
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПолучательДокументовПриИзменении(Элемент)
	СсылкаНаСправочник = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные.ПолучательДокументов;
	МассивРеквизитов = ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник);
	Обед = "Обед";
	Пробел = " ";
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Адрес = МассивРеквизитов[0] + Пробел + Обед + Пробел + МассивРеквизитов[4];
	СтрокаТаблицы.ФИОполучателя = МассивРеквизитов[1];
	СтрокаТаблицы.ТелПолучателя = МассивРеквизитов[2];
	СтрокаТаблицы.УровеньКлиента = МассивРеквизитов[3];
	СтрокаТаблицы.ВремяОбеда = МассивРеквизитов[4];
	
КонецПроцедуры

&НаСервере
Функция ТЧ_СписокРазвозаПолучательДокументовПриИзмененииНаСервере(СсылкаНаСправочник)
	
	РеквизитыКонтрагента = Новый Массив(10);
		
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Клиенты.Ссылка,
		|	Клиенты.Адрес,
		|	Клиенты.ФИОполучателя,
		|	Клиенты.ТелПолучателя,
		|	Клиенты.УровеньКлиента,
		|	Клиенты.ВремяОбеда,
		|	Клиенты.Представление
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСправочник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока (ВыборкаДетальныеЗаписи.Следующий()) Цикл
		РеквизитыКонтрагента [0] = ВыборкаДетальныеЗаписи.Адрес;
		РеквизитыКонтрагента [1] = ВыборкаДетальныеЗаписи.ФИОполучателя;
		РеквизитыКонтрагента [2] = ВыборкаДетальныеЗаписи.ТелПолучателя;
		РеквизитыКонтрагента [3] = ВыборкаДетальныеЗаписи.УровеньКлиента;
		РеквизитыКонтрагента [4] = ВыборкаДетальныеЗаписи.ВремяОбеда;
		
		
	КонецЦикла;
	
	Возврат РеквизитыКонтрагента;
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции






