&НаКлиенте
Процедура ЗаполнениеПоляНаименование()
	СтрокаТаблицы = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	СтрокаТаблицы.Наименование = "";
	Акт = "Акт ";
	УПД = " УПД ";
	Договор = " Договор ";
	ЛУРВы = " ЛУРВы ";
	СводныйАкт = " Сводный Акт ";
	КомплектПоставки = " Комплект Поставки ";
	АктСверки = " Акт Сверки ";
	Пробел = " ";
	Подарок1 = Объект.Подарок1;
	Подарок2 = Объект.Подарок2;
	Подарок3 = Объект.Подарок3;
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераАктов) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Акт + СтрокаТаблицы.НомераАктов;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераУПД) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + УПД + СтрокаТаблицы.НомераУПД;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НомераДоговоров) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Договор + СтрокаТаблицы.НомераДоговоров;	
	КонецЕсли; 
	
	Если СтрокаТаблицы.ЛУРВы Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + ЛУРВы;	
	КонецЕсли;
	
	Если СтрокаТаблицы.СводныйАкт Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + СводныйАкт;	
	КонецЕсли;
	
	Если СтрокаТаблицы.КомплектПоставки Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + КомплектПоставки;	
	КонецЕсли;
	
	Если СтрокаТаблицы.АктСверки Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + АктСверки;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок1 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок1;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок2 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок2;	
	КонецЕсли;
	
	Если СтрокаТаблицы.Подарок3 Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + Подарок3;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.СпециальнаяДоставка) Тогда
	СтрокаТаблицы.Наименование = СтрокаТаблицы.Наименование + Пробел + СтрокаТаблицы.СпециальнаяДоставка;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АвторДокумента = Пользователи.ТекущийПользователь() ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок1,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок2,
		|	КомуОтвезлиПодаркиСрезПоследних.Подарок3,
		|	КомуОтвезлиПодаркиСрезПоследних.ДокументыРазвозил,
		|	КомуОтвезлиПодаркиСрезПоследних.ДатаПроверкиПодарков,
		|	КомуОтвезлиПодаркиСрезПоследних.ВремяРазвозитьПодарки
		|ИЗ
		|	РегистрСведений.КомуОтвезлиПодарки.СрезПоследних КАК КомуОтвезлиПодаркиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Подарок1 = ВыборкаДетальныеЗаписи.Подарок1;
		Объект.Подарок2 = ВыборкаДетальныеЗаписи.Подарок2;
		Объект.Подарок3 = ВыборкаДетальныеЗаписи.Подарок3;
		Объект.ДокументыРазвозил = ВыборкаДетальныеЗаписи.ДокументыРазвозил;
		Объект.ДатаПроверкиПодарков = ВыборкаДетальныеЗаписи.ДатаПроверкиПодарков;
		Объект.ВремяРазвозитьПодарки = ВыборкаДетальныеЗаписи.ВремяРазвозитьПодарки;
	КонецЦикла;
	
		
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьРеквизитыИзМассива(Элемент)
	Обед = "Обед";
	Пробел = " ";
	СтрокаТаблицыМ = Элементы.ТЧ_СписокРазвоза.ТекущиеДанные;
	МассивРеквизитов = ПолучитьРеквизитыКонтрагентаВМассив(СтрокаТаблицыМ.ПолучательДокументов);
	СтрокаТаблицыМ.Адрес = МассивРеквизитов[0] + Пробел + Обед + Пробел + МассивРеквизитов[4];
	СтрокаТаблицыМ.ФИОполучателя = МассивРеквизитов[1];
	СтрокаТаблицыМ.ТелПолучателя = МассивРеквизитов[2];
	СтрокаТаблицыМ.УровеньКлиента = МассивРеквизитов[3];
	СтрокаТаблицыМ.ВремяОбеда = МассивРеквизитов[4];
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыКонтрагентаВМассив (СсылкаНаСправочник)
РеквизитыКонтрагента = Новый Массив(10);
РеквизитыКонтрагента [0] = СсылкаНаСправочник.Адрес;
РеквизитыКонтрагента [1] = СсылкаНаСправочник.ФИОполучателя;
РеквизитыКонтрагента [2] = СсылкаНаСправочник.ТелПолучателя;
РеквизитыКонтрагента [3] = СсылкаНаСправочник.УровеньКлиента;
РеквизитыКонтрагента [4] = СсылкаНаСправочник.ВремяОбеда;
Возврат РеквизитыКонтрагента;

КонецФункции


&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераАктовПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераУПДПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаНомераДоговоровПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаЛУРВыПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаКомплектПоставкиПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаСводныйАктПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаАктСверкиПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаСпециальнаяДоставкаПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок1ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок2ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПодарок3ПриИзменении(Элемент)
	ЗаполнениеПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СписокРазвозаПолучательДокументовПриИзменении(Элемент)
	ЗаполнитьРеквизитыИзМассива(Элемент);
КонецПроцедуры




















