///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии GNU GENERAL PUBLIC LICENSE
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ОтправкаПочтыИнформацияООтправленныхДокументах.Сумма) КАК Сумма,
		|	ОтправкаПочты.Ссылка
		|ИЗ
		|	Документ.РасшДТ_ОтправкаПочты.ИнформацияООтправленныхДокументах КАК ОтправкаПочтыИнформацияООтправленныхДокументах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасшДТ_ОтправкаПочты КАК ОтправкаПочты
		|		ПО ОтправкаПочтыИнформацияООтправленныхДокументах.Ссылка = ОтправкаПочты.Ссылка
		|ГДЕ
		|	ОтправкаПочты.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОтправкаПочты.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтотОбъект.ПотраченоНаПочтовыеРасходы = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	ЭтотОбъект.ОсталосьПотратитьНаПочтовыеРасходы = ЭтотОбъект.НеИзрасходованныеСредстваИзПредыдущегоОтчета + ЭтотОбъект.ПолученоНаПочтовыеРасходы - ЭтотОбъект.ПотраченоНаПочтовыеРасходы;
	

	// регистр РасшДТ_ДоставкаДокументовКурьером
	Движения.РасшДТ_ДоставкаДокументовКурьером.Записывать = Истина;
	Для Каждого ТекСтрокаИнформацияООтправленныхДокументах из ИнформацияООтправленныхДокументах Цикл
		Движение = Движения.РасшДТ_ДоставкаДокументовКурьером.Добавить();
		Движение.Период = Дата;
		Движение.АвторДокумента = ПисьмаОтправил;
		Движение.Дата = ТекСтрокаИнформацияООтправленныхДокументах.ДатаОтправкиПисьма;
		Движение.ПолучательДокументов = ТекСтрокаИнформацияООтправленныхДокументах.ПолучательДокументов;
		Движение.Наименование = ТекСтрокаИнформацияООтправленныхДокументах.ОписьСодержимогоКонверта;
	КонецЦикла;
	
КонецПроцедуры