Процедура ОбработкаПроведения(Отказ,Режим)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ОтправкаПочтыИнформацияООтправленныхДокументах.Сумма) КАК Сумма,
		|	ОтправкаПочты.Ссылка
		|ИЗ
		|	Документ.РасшДТ_ОтправкаПочты.ИнформацияООтправленныхДокументах КАК ОтправкаПочтыИнформацияООтправленныхДокументах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасшДТ_ОтправкаПочты КАК ОтправкаПочты
		|		ПО ОтправкаПочтыИнформацияООтправленныхДокументах.Ссылка = ОтправкаПочты.Ссылка
		|ГДЕ
		|	ОтправкаПочты.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ОтправкаПочты.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтотОбъект.ПотраченоНаПочтовыеРасходы = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	
	ЭтотОбъект.ОсталосьПотратитьНаПочтовыеРасходы = ЭтотОбъект.НеИзрасходованныеСредстваИзПредыдущегоОтчета + ЭтотОбъект.ПолученоНаПочтовыеРасходы - ЭтотОбъект.ПотраченоНаПочтовыеРасходы;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РасшДТ_ДоставкаДокументовКурьером
	Движения.РасшДТ_ДоставкаДокументовКурьером.Записывать = Истина;
	Для Каждого ТекСтрокаИнформацияООтправленныхДокументах из ИнформацияООтправленныхДокументах Цикл
		Движение = Движения.РасшДТ_ДоставкаДокументовКурьером.Добавить();
		Движение.Период = Дата;
		Движение.АвторДокумента = ПисьмаОтправил;
		Движение.Дата = ТекСтрокаИнформацияООтправленныхДокументах.ДатаОтправкиПисьма;
		Движение.ПолучательДокументов = ТекСтрокаИнформацияООтправленныхДокументах.ПолучательДокументов;
		Движение.Наименование = ТекСтрокаИнформацияООтправленныхДокументах.ОписьСодержимогоКонверта;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры