
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОборотыПоТоргам
	Движения.ОборотыПоТоргам.Записывать = Истина;
	Движение = Движения.ОборотыПоТоргам.Добавить();
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.СуммаПоИтогамТоргов = СуммаПоИтогамТоргов;

	// регистр ТоргиВРаботе
	Движения.ТоргиВРаботе.Записывать = Истина;
	Движение = Движения.ТоргиВРаботе.Добавить();
	Движение.РегионОказанияУслуг = РегионОказанияУслуг;
	Движение.Заказчик = Заказчик;
	Движение.ПредметЗакупки = ПредметЗакупки;
	Движение.ОкончаниеПодачиЗаявок = ОкончаниеПодачиЗаявок;
	Движение.ДатаТоргов = ДатаТоргов;
	Движение.СостояниеЗакупки = СостояниеЗакупки;
	Движение.СуммаНачальная = СуммаНачальная;

	// регистр ДанныеОСтоимостиЧасаНаТоргах
	Движения.ДанныеОСтоимостиЧасаНаТоргах.Записывать = Истина;
	Движение = Движения.ДанныеОСтоимостиЧасаНаТоргах.Добавить();
	Движение.Дата = Дата;
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.СтоимостьЧасаИтоговая = СтоимостьЧасаИтоговая;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
