///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии GNU GENERAL PUBLIC LICENSE
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РасшДТ_ОборотыПоТоргам
	Движения.РасшДТ_ОборотыПоТоргам.Записывать = Истина;
	Движение = Движения.РасшДТ_ОборотыПоТоргам.Добавить();
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.СуммаПоИтогамТоргов = СуммаПоИтогамТоргов;

	// регистр РасшДТ_ТоргиВРаботе
	Движения.РасшДТ_ТоргиВРаботе.Записывать = Истина;
	Движение = Движения.РасшДТ_ТоргиВРаботе.Добавить();
	Движение.РегионОказанияУслуг = РегионОказанияУслуг;
	Движение.Заказчик = Заказчик;
	Движение.ПредметЗакупки = ПредметЗакупки;
	Движение.ОкончаниеПодачиЗаявок = ОкончаниеПодачиЗаявок;
	Движение.ДатаТоргов = ДатаТоргов;
	Движение.СостояниеЗакупки = СостояниеЗакупки;
	Движение.СуммаНачальная = СуммаНачальная;

	// регистр РасшДТ_ДанныеОСтоимостиЧасаНаТоргах
	Движения.РасшДТ_ДанныеОСтоимостиЧасаНаТоргах.Записывать = Истина;
	Движение = Движения.РасшДТ_ДанныеОСтоимостиЧасаНаТоргах.Добавить();
	Движение.Дата = Дата;
	Движение.Период = Дата;
	Движение.КтоВыигралТорги = КтоВыигралТорги;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.СтоимостьЧасаИтоговая = СтоимостьЧасаИтоговая;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
